Revit 2027 API
MechanicalSystem Class
 A mechanical system element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.MEPSystem
 Autodesk.Revit.DB.Mechanical.MechanicalSystem
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class MechanicalSystem : MEPSystem
Public Class MechanicalSystem
	Inherits MEPSystem
public ref class MechanicalSystem : public MEPSystem
type MechanicalSystem =
    class
        inherit MEPSystem
    end
The MechanicalSystem type exposes the following members.
Properties
Name | Description
AssemblyInstanceId |  The id of the assembly instance to which the element belongs.
(Inherited from Element)
BaseEquipment | The base panel or equipment of the system.
(Inherited from MEPSystem)
BaseEquipmentConnector | The connector within the base equipment which is used to connect with the system.
BoundingBox | Retrieves a box that circumscribes all geometry of the element.
(Inherited from Element)
Category | Retrieves a Category object that represents the category or sub category in which the element resides.
(Inherited from Element)
ConnectorManager | Connector manager of the system.
(Inherited from MEPSystem)
CreatedPhaseId |  Id of a Phase at which the Element was created.
(Inherited from Element)
DemolishedPhaseId |  Id of a Phase at which the Element was demolished.
(Inherited from Element)
DesignOption | Returns the design option to which the element belongs.
(Inherited from Element)
Document | Returns the Document in which the Element resides.
(Inherited from Element)
DuctNetwork |  The ducts and fittings contained within the system.
Elements | Terminal elements in the system.
(Inherited from MEPSystem)
Geometry | Retrieves the geometric representation of the element.
(Inherited from Element)
GroupId |  The id of the group to which an element belongs.
(Inherited from Element)
HasDesignParts |  Indicates if the system has one or more design parts.
(Inherited from MEPSystem)
HasFabricationParts |  Indicates if the system has one or more fabrication parts.
(Inherited from MEPSystem)
HasPlaceholders |  Indicates if the system has one or more placeholders.
(Inherited from MEPSystem)
Id |  A unique identifier for an Element in an Autodesk Revit project.
(Inherited from Element)
IsEmpty |  Indicates if the system is empty or not.
(Inherited from MEPSystem)
IsModifiable |  Identifies if the element is modifiable.
(Inherited from Element)
IsMultipleNetwork |  Indicates if the system is well connected or not. The flag will enable the "Divide System" button.
(Inherited from MEPSystem)
IsTransient |  Indicates whether an element is transient or permanent.
(Inherited from Element)
IsValid |  Indicates if the system is valid or not. atom AtomValidateSystem default false
(Inherited from MEPSystem)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from Element)
IsWellConnected |  Indicates if the system is well connected or not.
LevelId |  The id of the level associated with the element.
(Inherited from Element)
Location | This property is used to find the physical location of an element within a project.
(Inherited from Element)
Name | A human readable name for the Element.
(Inherited from Element)
OwnerViewId |  The id of the view that owns the element.
(Inherited from Element)
Parameter[BuiltInParameter] | Retrieves a parameter from the element given a parameter id.
(Inherited from Element)
Parameter[Definition] | Retrieves a parameter from the element based on its definition.
(Inherited from Element)
Parameter[Guid] | Retrieves a parameter from the element given a GUID for a shared parameter.
(Inherited from Element)
Parameters | Retrieves a set containing all of the parameters that are contained within the element.
(Inherited from Element)
ParametersMap | Retrieves a map containing all of the parameters that are contained within the element.
(Inherited from Element)
Pinned |  Identifies if the element has been pinned to prevent changes.
(Inherited from Element)
PressureLossOfCriticalPath |  The total pressure loss of the sections in critical path.
(Inherited from MEPSystem)
SectionsCount |  The number of sections.
(Inherited from MEPSystem)
SystemType | The type of this duct system.
UniqueId |  A stable unique identifier for an element within the document.
(Inherited from Element)
VersionGuid |  Get the element version Guid.
(Inherited from Element)
ViewSpecific |  Identifies if the element is owned by a view.
(Inherited from Element)
WorksetId |  Get Id of the Workset which owns the element.
(Inherited from Element)
Top
Methods
Name | Description
Add |  Add elements into the system and connect them with the system using given connectors.
(Inherited from MEPSystem)
ArePhasesModifiable |  Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.
(Inherited from Element)
CanBeHidden | Indicates if the element can be hidden in the view.
(Inherited from Element)
CanBeLocked |  Identifies if the element can be locked.
(Inherited from Element)
CanDeleteSubelement |  Checks if given subelement can be removed from the element.
(Inherited from Element)
CanHaveTypeAssigned() |  Identifies if the element can have a type assigned.
(Inherited from Element)
ChangeTypeId(ElementId) |  Changes the type of the element.
(Inherited from Element)
Create(Document, ElementId) |  Creates a new instance of a mechanical system and adds it to the document.
Create(Document, ElementId, String) |  Creates a new instance of a mechanical system and adds it to the document.
DeleteEntity |  Deletes the existing entity created by %schema% in the element
(Inherited from Element)
DeleteSubelement |  Removes a subelement from the element.
(Inherited from Element)
DeleteSubelements |  Removes the subelements from the element.
(Inherited from Element)
Dispose
(Inherited from Element)
DivideSystem |  Divide the phyisical networks in the system and create a new system for each network.
(Inherited from MEPSystem)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
EvaluateAllParameterValues |  Evaluates all the parameters' values of the element.
(Inherited from Element)
EvaluateParameterValues |  Evaluate the parameters' values of the element on the given parameter ID set.
(Inherited from Element)
GetCriticalPathSectionNumbers |  Obtains a list of the critical path section numbers.
(Inherited from MEPSystem)
GetDependentElements |  Get all elements that, from a logical point of view, are the children of this Element.
(Inherited from Element)
GetEntity |  Returns the existing entity corresponding to the Schema if it has been saved in the Element, or an invalid entity otherwise.
(Inherited from Element)
GetEntitySchemaGuids |  Returns the Schema guids of any Entities stored in this element.
(Inherited from Element)
GetExternalFileReference |  Gets information pertaining to the external file referenced by the element.
(Inherited from Element)
GetExternalResourceReference |  Gets the ExternalResourceReference associated with a specified external resource type.
(Inherited from Element)
GetExternalResourceReferenceExpanded |  Gets the collection of ExternalResourceReference associated with a specified external resource type.
(Inherited from Element)
GetExternalResourceReferences |  Gets the map of the external resource references referenced by the element.
(Inherited from Element)
GetExternalResourceReferencesExpanded |  Gets the expanded map of the external resource references referenced by the element.
(Inherited from Element)
GetFlow |  Gets the flow of this mechanical system.
GetGeneratingElementIds |  Returns the ids of the element(s) that generated the input geometry object.
(Inherited from Element)
GetGeometryObjectFromReference |  Retrieve one geometric primitive contained in the element given a reference.
(Inherited from Element)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetMaterialArea |  Gets the area of the material with the given id.
(Inherited from Element)
GetMaterialIds |  Gets the element ids of all materials present in the element.
(Inherited from Element)
GetMaterialVolume |  Gets the volume of the material with the given id.
(Inherited from Element)
GetMonitoredLinkElementIds |  Provides the link instance IDs when the element is monitoring.
(Inherited from Element)
GetMonitoredLocalElementIds |  Provides the local element IDs when the element is monitoring.
(Inherited from Element)
GetOrderedParameters |  Gets the parameters associated to the element in order.
(Inherited from Element)
GetParameter | Retrieves a parameter from the element given identifier.
(Inherited from Element)
GetParameterFormatOptions |  Returns a FormatOptions override for the element Parameter, or a default FormatOptions if no override exists.
(Inherited from Element)
GetParameters | Retrieves the parameters from the element via the given name.
(Inherited from Element)
GetPhaseStatus |  Gets the status of a given element in the input phase
(Inherited from Element)
GetPhysicalNetworksNumber |  Get the physical networks number in the system.
(Inherited from MEPSystem)
GetSectionByIndex |  Get the section from the index.
(Inherited from MEPSystem)
GetSectionByNumber |  Get the Section from section number
(Inherited from MEPSystem)
GetStaticPressure |  Gets the static pressure of this mechanical system.
GetSubelements |  Returns the collection of element subelements.
(Inherited from Element)
GetType | Gets the Type of the current instance.
(Inherited from Object)
GetTypeId |  Returns the identifier of this element's type.
(Inherited from Element)
GetValidTypes() |  Obtains a set of types that are valid for this element.
(Inherited from Element)
HasPhases |  Returns true if this Element has the properties CreatedPhaseId and DemolishedPhaseId.
(Inherited from Element)
IsCreatedPhaseOrderValid |  Returns true if createdPhaseId and demolishedPhaseId are in order.
(Inherited from Element)
IsDemolishedPhaseOrderValid |  Returns true if createdPhaseId and demolishedPhaseId are in order.
(Inherited from Element)
IsExternalFileReference |  Determines whether this Element represents an external file.
(Inherited from Element)
IsHidden | Identifies if the element has been permanently hidden in the view.
(Inherited from Element)
IsMonitoringLinkElement |  Indicate whether an element is monitoring any elements in any linked models.
(Inherited from Element)
IsMonitoringLocalElement |  Indicate whether an element is monitoring other local elements.
(Inherited from Element)
IsPhaseCreatedValid |  Returns true if createdPhaseId is an allowed value for the property CreatedPhaseId in this Element.
(Inherited from Element)
IsPhaseDemolishedValid |  Returns true if demolishedPhaseId is an allowed value for the property DemolishedPhaseId in this Element.
(Inherited from Element)
IsPressureDropServerMissing |  Indicates if any pressure drop server which was used in the mechanical system is not available.
IsSystemDividable |  Checks if the system is dividable. The system is dividable if there is more than one physical network in the system. Currently, only HVAC and piping systems support dividing.
(Inherited from MEPSystem)
IsValidType(ElementId) |  Checks if given type is valid for this element.
(Inherited from Element)
LookupParameter | Attempts to find a parameter on the element which has the given name.
(Inherited from Element)
RefersToExternalResourceReference |  Determines whether this Element uses external resources associated with a specified external resource type.
(Inherited from Element)
RefersToExternalResourceReferences |  Determines whether this Element uses external resources.
(Inherited from Element)
Remove(ConnectorSet) | Removes connectors from system.
(Inherited from MEPSystem)
Remove(ICollection<ElementId>) | Remove elements from system.
(Inherited from MEPSystem)
SetEntity |  Stores the entity in the element. If an Entity described by the same Schema already exists, it is overwritten.
(Inherited from Element)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace